addenda_comercial_mexicana/static/stamp.wsdl

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions xmlns:wsa="http://schemas.xmlsoap.org/ws/2003/03/addressing" xmlns:tns="http://facturacion.finkok.com/stamp" xmlns:plink="http://schemas.xmlsoap.org/ws/2003/05/partner-link/" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:senc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:s1="https://facturacion.finkok.com/servicios/async" xmlns:s0="apps.services.soap.core.views" xmlns:s12env="http://www.w3.org/2003/05/soap-envelope/" xmlns:s12enc="http://www.w3.org/2003/05/soap-encoding/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:senv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" targetNamespace="http://facturacion.finkok.com/stamp" name="Application"><wsdl:types><xs:schema targetNamespace="https://facturacion.finkok.com/servicios/async" elementFormDefault="qualified"><xs:import namespace="apps.services.soap.core.views"/><xs:complexType name="AcuseRecepcionAsync"><xs:sequence><xs:element name="UUID" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="RfcProvCertif" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="NoCertificadoSAT" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="CodEstatus" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="faultstring" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="faultcode" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="file" type="xs:base64Binary" minOccurs="0" nillable="true"/><xs:element name="SatSeal" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="Incidencias" type="s0:IncidenciaArray" minOccurs="0" nillable="true"/><xs:element name="FechaTimbrado" type="xs:dateTime" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="AcuseRecepcionAsync" type="s1:AcuseRecepcionAsync"/></xs:schema><xs:schema targetNamespace="apps.services.soap.core.views" elementFormDefault="qualified"><xs:complexType name="ResultAsync"><xs:sequence><xs:element name="status" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="Incidencias" type="s0:IncidenciaArray" minOccurs="0" nillable="true"/><xs:element name="id" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="PDFResult"><xs:sequence><xs:element name="pdf" type="xs:base64Binary" minOccurs="0" nillable="true"/><xs:element name="error" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="AcuseRecepcionCFDI"><xs:sequence><xs:element name="xml" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="UUID" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="faultstring" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="Fecha" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="CodEstatus" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="faultcode" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="SatSeal" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="Incidencias" type="s0:IncidenciaArray" minOccurs="0" nillable="true"/><xs:element name="NoCertificadoSAT" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="IncidenciaArray"><xs:sequence><xs:element name="Incidencia" type="s0:Incidencia" minOccurs="0" maxOccurs="unbounded" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="QueryPendingResult"><xs:sequence><xs:element name="status" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="xml" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="uuid" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="uuid_status" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="next_attempt" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="attempts" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="error" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="date" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="Incidencia"><xs:sequence><xs:element name="IdIncidencia" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="RfcEmisor" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="Uuid" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="CodigoError" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="WorkProcessId" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="MensajeIncidencia" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="ExtraInfo" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="NoCertificadoPac" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="FechaRegistro" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="Incidencia" type="s0:Incidencia"/><xs:element name="QueryPendingResult" type="s0:QueryPendingResult"/><xs:element name="IncidenciaArray" type="s0:IncidenciaArray"/><xs:element name="AcuseRecepcionCFDI" type="s0:AcuseRecepcionCFDI"/><xs:element name="PDFResult" type="s0:PDFResult"/><xs:element name="ResultAsync" type="s0:ResultAsync"/></xs:schema><xs:schema targetNamespace="http://facturacion.finkok.com/stamp" elementFormDefault="qualified"><xs:import namespace="apps.services.soap.core.views"/><xs:import namespace="https://facturacion.finkok.com/servicios/async"/><xs:complexType name="query_pending"><xs:sequence><xs:element name="username" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="password" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="uuid" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="stamp_asyncResponse"><xs:sequence><xs:element name="stamp_asyncResult" type="s0:ResultAsync" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="quick_stamp"><xs:sequence><xs:element name="xml" type="xs:base64Binary" minOccurs="0" nillable="true"/><xs:element name="username" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="password" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="stampResponse"><xs:sequence><xs:element name="stampResult" type="s0:AcuseRecepcionCFDI" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="get_result_async"><xs:sequence><xs:element name="id" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="username" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="password" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="get_pdf"><xs:sequence><xs:element name="username" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="password" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="uuid" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="stamp"><xs:sequence><xs:element name="xml" type="xs:base64Binary" minOccurs="0" nillable="true"/><xs:element name="username" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="password" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="sign_stampResponse"><xs:sequence><xs:element name="sign_stampResult" type="s0:AcuseRecepcionCFDI" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="get_result_asyncResponse"><xs:sequence><xs:element name="get_result_asyncResult" type="s1:AcuseRecepcionAsync" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="quick_stampResponse"><xs:sequence><xs:element name="quick_stampResult" type="s0:AcuseRecepcionCFDI" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="stamp_async"><xs:sequence><xs:element name="file" type="xs:base64Binary"/><xs:element name="username" type="xs:string"/><xs:element name="password" type="xs:string"/><xs:element name="ctype" type="tns:stamp_async_ctypeType" minOccurs="0"/></xs:sequence></xs:complexType><xs:simpleType name="stamp_async_ctypeType"><xs:restriction base="xs:string"><xs:enumeration value="zip"/><xs:enumeration value="gzip"/></xs:restriction></xs:simpleType><xs:complexType name="query_pendingResponse"><xs:sequence><xs:element name="query_pendingResult" type="s0:QueryPendingResult" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="get_pdfResponse"><xs:sequence><xs:element name="get_pdfResult" type="s0:PDFResult" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="stampedResponse"><xs:sequence><xs:element name="stampedResult" type="s0:AcuseRecepcionCFDI" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="stamped"><xs:sequence><xs:element name="xml" type="xs:base64Binary" minOccurs="0" nillable="true"/><xs:element name="username" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="password" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="sign_stamp"><xs:sequence><xs:element name="xml" type="xs:base64Binary" minOccurs="0" nillable="true"/><xs:element name="username" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="password" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="sign_stamp" type="tns:sign_stamp"/><xs:element name="stamped" type="tns:stamped"/><xs:element name="stampedResponse" type="tns:stampedResponse"/><xs:element name="get_pdfResponse" type="tns:get_pdfResponse"/><xs:element name="query_pendingResponse" type="tns:query_pendingResponse"/><xs:element name="stamp_async" type="tns:stamp_async"/><xs:element name="quick_stampResponse" type="tns:quick_stampResponse"/><xs:element name="get_result_asyncResponse" type="tns:get_result_asyncResponse"/><xs:element name="sign_stampResponse" type="tns:sign_stampResponse"/><xs:element name="stamp" type="tns:stamp"/><xs:element name="get_pdf" type="tns:get_pdf"/><xs:element name="get_result_async" type="tns:get_result_async"/><xs:element name="stampResponse" type="tns:stampResponse"/><xs:element name="quick_stamp" type="tns:quick_stamp"/><xs:element name="stamp_asyncResponse" type="tns:stamp_asyncResponse"/><xs:element name="query_pending" type="tns:query_pending"/></xs:schema></wsdl:types><wsdl:message name="sign_stamp"><wsdl:part name="sign_stamp" element="tns:sign_stamp"/></wsdl:message><wsdl:message name="sign_stampResponse"><wsdl:part name="sign_stampResponse" element="tns:sign_stampResponse"/></wsdl:message><wsdl:message name="stamped"><wsdl:part name="stamped" element="tns:stamped"/></wsdl:message><wsdl:message name="stampedResponse"><wsdl:part name="stampedResponse" element="tns:stampedResponse"/></wsdl:message><wsdl:message name="stamp"><wsdl:part name="stamp" element="tns:stamp"/></wsdl:message><wsdl:message name="stampResponse"><wsdl:part name="stampResponse" element="tns:stampResponse"/></wsdl:message><wsdl:message name="stamp_async"><wsdl:part name="stamp_async" element="tns:stamp_async"/></wsdl:message><wsdl:message name="stamp_asyncResponse"><wsdl:part name="stamp_asyncResponse" element="tns:stamp_asyncResponse"/></wsdl:message><wsdl:message name="query_pending"><wsdl:part name="query_pending" element="tns:query_pending"/></wsdl:message><wsdl:message name="query_pendingResponse"><wsdl:part name="query_pendingResponse" element="tns:query_pendingResponse"/></wsdl:message><wsdl:message name="get_pdf"><wsdl:part name="get_pdf" element="tns:get_pdf"/></wsdl:message><wsdl:message name="get_pdfResponse"><wsdl:part name="get_pdfResponse" element="tns:get_pdfResponse"/></wsdl:message><wsdl:message name="quick_stamp"><wsdl:part name="quick_stamp" element="tns:quick_stamp"/></wsdl:message><wsdl:message name="quick_stampResponse"><wsdl:part name="quick_stampResponse" element="tns:quick_stampResponse"/></wsdl:message><wsdl:message name="get_result_async"><wsdl:part name="get_result_async" element="tns:get_result_async"/></wsdl:message><wsdl:message name="get_result_asyncResponse"><wsdl:part name="get_result_asyncResponse" element="tns:get_result_asyncResponse"/></wsdl:message><wsdl:portType name="Application"><wsdl:operation name="sign_stamp" parameterOrder="sign_stamp"><wsdl:documentation>This function provides the sign stamping service to resellers</wsdl:documentation><wsdl:input name="sign_stamp" message="tns:sign_stamp"/><wsdl:output name="sign_stampResponse" message="tns:sign_stampResponse"/></wsdl:operation><wsdl:operation name="stamped" parameterOrder="stamped"><wsdl:documentation>This function returns the stamp information of an invoice</wsdl:documentation><wsdl:input name="stamped" message="tns:stamped"/><wsdl:output name="stampedResponse" message="tns:stampedResponse"/></wsdl:operation><wsdl:operation name="stamp" parameterOrder="stamp"><wsdl:documentation>This function provides the stamping service to resellers</wsdl:documentation><wsdl:input name="stamp" message="tns:stamp"/><wsdl:output name="stampResponse" message="tns:stampResponse"/></wsdl:operation><wsdl:operation name="stamp_async" parameterOrder="stamp_async"><wsdl:documentation>This function provides the stamping service to resellers, with the option to send large files in zip/gzip files (maximum 1 xml file compressed)</wsdl:documentation><wsdl:input name="stamp_async" message="tns:stamp_async"/><wsdl:output name="stamp_asyncResponse" message="tns:stamp_asyncResponse"/></wsdl:operation><wsdl:operation name="query_pending" parameterOrder="query_pending"><wsdl:documentation>This method returns the status of a peding buffer invoice by using an uuid</wsdl:documentation><wsdl:input name="query_pending" message="tns:query_pending"/><wsdl:output name="query_pendingResponse" message="tns:query_pendingResponse"/></wsdl:operation><wsdl:operation name="get_pdf" parameterOrder="get_pdf"><wsdl:documentation>This class returns the pd=fd for the given uuid</wsdl:documentation><wsdl:input name="get_pdf" message="tns:get_pdf"/><wsdl:output name="get_pdfResponse" message="tns:get_pdfResponse"/></wsdl:operation><wsdl:operation name="quick_stamp" parameterOrder="quick_stamp"><wsdl:documentation>This function provides the quick stamping service to resellers</wsdl:documentation><wsdl:input name="quick_stamp" message="tns:quick_stamp"/><wsdl:output name="quick_stampResponse" message="tns:quick_stampResponse"/></wsdl:operation><wsdl:operation name="get_result_async" parameterOrder="get_result_async"><wsdl:documentation>This function provides gets the result from an async task id </wsdl:documentation><wsdl:input name="get_result_async" message="tns:get_result_async"/><wsdl:output name="get_result_asyncResponse" message="tns:get_result_asyncResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="Application" type="tns:Application"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="sign_stamp"><soap:operation soapAction="sign_stamp" style="document"/><wsdl:input name="sign_stamp"><soap:body use="literal"/></wsdl:input><wsdl:output name="sign_stampResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="stamped"><soap:operation soapAction="stamped" style="document"/><wsdl:input name="stamped"><soap:body use="literal"/></wsdl:input><wsdl:output name="stampedResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="stamp"><soap:operation soapAction="stamp" style="document"/><wsdl:input name="stamp"><soap:body use="literal"/></wsdl:input><wsdl:output name="stampResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="stamp_async"><soap:operation soapAction="stamp_async" style="document"/><wsdl:input name="stamp_async"><soap:body use="literal"/></wsdl:input><wsdl:output name="stamp_asyncResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="query_pending"><soap:operation soapAction="query_pending" style="document"/><wsdl:input name="query_pending"><soap:body use="literal"/></wsdl:input><wsdl:output name="query_pendingResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="get_pdf"><soap:operation soapAction="get_pdf" style="document"/><wsdl:input name="get_pdf"><soap:body use="literal"/></wsdl:input><wsdl:output name="get_pdfResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="quick_stamp"><soap:operation soapAction="quick_stamp" style="document"/><wsdl:input name="quick_stamp"><soap:body use="literal"/></wsdl:input><wsdl:output name="quick_stampResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="get_result_async"><soap:operation soapAction="get_result_async" style="document"/><wsdl:input name="get_result_async"><soap:body use="literal"/></wsdl:input><wsdl:output name="get_result_asyncResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="StampSOAP"><wsdl:port name="Application" binding="tns:Application"><soap:address location="https://demo-facturacion.finkok.com/servicios/soap/stamp"/></wsdl:port></wsdl:service></wsdl:definitions>