public/request/SOAP_Request_stamp.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://facturacion.finkok.com/stamp" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="apps.services.soap.core.views"><env:Body><tns:sign_stamp><tns:xml>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPGNmZGk6
Q29tcHJvYmFudGUgeG1sbnM6Y2ZkaT0iaHR0cDovL3d3dy5zYXQuZ29iLm14
L2NmZC8zIiB4bWxuczp4c2k9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvWE1M
U2NoZW1hLWluc3RhbmNlIiB4c2k6c2NoZW1hTG9jYXRpb249Imh0dHA6Ly93
d3cuc2F0LmdvYi5teC9jZmQvMyBodHRwOi8vd3d3LnNhdC5nb2IubXgvc2l0
aW9faW50ZXJuZXQvY2ZkLzMvY2ZkdjMzLnhzZCIgVmVyc2lvbj0iMy4zIiBT
ZXJpZT0iQSIgRm9saW89IjE2N0FCQyIgRmVjaGE9IjIwMTctMTAtMjZUMDk6
MDk6MjMiIFNlbGxvPSIiIE5vQ2VydGlmaWNhZG89IjIwMDAxMDAwMDAwMzAw
MDIyODE1IiBDZXJ0aWZpY2Fkbz0iIiBTdWJUb3RhbD0iMzAwLjAwIiBNb25l
ZGE9Ik1YTiIgVG90YWw9IjM0OC4wMCIgVGlwb0RlQ29tcHJvYmFudGU9Ikki
IEZvcm1hUGFnbz0iMDEiIE1ldG9kb1BhZ289IlBVRSIgQ29uZGljaW9uZXNE
ZVBhZ289IkNPTkRJQ0lPTkVTIiBEZXNjdWVudG89IjAuMDAiIFRpcG9DYW1i
aW89IjEiIEx1Z2FyRXhwZWRpY2lvbj0iNDUwNzkiPgogIDxjZmRpOkVtaXNv
ciBSZmM9IkxBTjcwMDgxNzNSNSIgTm9tYnJlPSJDSU5ERU1FWCBTQSBERSBD
ViIgUmVnaW1lbkZpc2NhbD0iNjAxIi8+CiAgPGNmZGk6UmVjZXB0b3IgUmZj
PSJIRVBSOTMwMzIyOTc3IiBOb21icmU9IlJBRkFFTCBBTEVKQU5EUk8gSEVS
TsOBTkRFWiBQQUxBQ0lPUyIgVXNvQ0ZEST0iRzAxIi8+CiAgPGNmZGk6Q29u
Y2VwdG9zPgogICAgPGNmZGk6Q29uY2VwdG8gQ2xhdmVQcm9kU2Vydj0iMDEw
MTAxMDEiIENsYXZlVW5pZGFkPSJGNTIiIE5vSWRlbnRpZmljYWNpb249IjAw
MDAxIiBDYW50aWRhZD0iMiIgVW5pZGFkPSJUT05FTEFEQSIgRGVzY3JpcGNp
b249IkFDRVJPIiBWYWxvclVuaXRhcmlvPSIxNTAuMDAiIEltcG9ydGU9IjMw
MC4wMCI+CiAgICAgIDxjZmRpOkltcHVlc3Rvcz4KICAgICAgICA8Y2ZkaTpU
cmFzbGFkb3M+CiAgICAgICAgICA8Y2ZkaTpUcmFzbGFkbyBCYXNlPSIzMDAu
MDAiIEltcHVlc3RvPSIwMDIiIFRpcG9GYWN0b3I9IlRhc2EiIFRhc2FPQ3Vv
dGE9IjAuMTYwMDAwIiBJbXBvcnRlPSI0OC4wMCIvPgogICAgICAgIDwvY2Zk
aTpUcmFzbGFkb3M+CiAgICAgIDwvY2ZkaTpJbXB1ZXN0b3M+CiAgICA8L2Nm
ZGk6Q29uY2VwdG8+CiAgPC9jZmRpOkNvbmNlcHRvcz4KICA8Y2ZkaTpJbXB1
ZXN0b3MgVG90YWxJbXB1ZXN0b3NUcmFzbGFkYWRvcz0iNDguMDAiPgogICAg
PGNmZGk6VHJhc2xhZG9zPgogICAgICA8Y2ZkaTpUcmFzbGFkbyBJbXB1ZXN0
bz0iMDAyIiBUaXBvRmFjdG9yPSJUYXNhIiBUYXNhT0N1b3RhPSIwLjE2MDAw
MCIgSW1wb3J0ZT0iNDguMDAiLz4KICAgIDwvY2ZkaTpUcmFzbGFkb3M+CiAg
PC9jZmRpOkltcHVlc3Rvcz4KPC9jZmRpOkNvbXByb2JhbnRlPgo=
</tns:xml><tns:username>favio.velez@hotmail.com</tns:username><tns:password>Plata353909$</tns:password></tns:sign_stamp></env:Body></env:Envelope>